## Q12

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT (SELECT name 
		FROM customer cs 
        WHERE cs.custid=od.custid)'name',SUM(saleprice) 'total'
FROM orders od
GROUP BY od.custid;'''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0      1
0  박지성  39000
1  김연아  15000
2  장미란  31000
3  추신수  33000

## Q13

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SELECT * FROM orders;'''

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0  1   2      3           4                  5
0   1  1   1   6000  2014-07-01             축구의 역사
1   2  1   3  21000  2014-07-03             축구의 이해
2   3  2   5   8000  2014-07-03              피겨 교본
3   4  3   6   6000  2014-07-04           역도 단계별기술
4   5  4   7  20000  2014-07-05             야구의 추억
5   6  1   2  12000  2014-07-07            축구아는 여자
6   7  4   8  13000  2014-07-07            야구를 부탁해
7   8  3  10  12000  2014-07-08  Olympic Champions
8   9  2  10   7000  2014-07-09  Olympic Champions
9  10  3   8  13000  2014-07-10            야구를 부탁해

## Q14

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT cs.name, SUM(od.saleprice)'total'
FROM (SELECT custid,name 
	  FROM customer
      WHERE custid<=2)cs, orders od
WHERE cs.custid=od.custid
GROUP BY cs.name;'''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0      1
0  박지성  39000
1  김연아  15000

## Q15

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SELECT orderid,saleprice
FROM orders
WHERE saleprice<=(SELECT AVG(saleprice) FROM orders);'''

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0     1
0  1  6000
1  3  8000
2  4  6000
3  9  7000

## Q16

In [25]:
import pandas as pd
import pymysql

In [26]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [27]:
cur_1=conn1.cursor()

In [28]:
sql='''SELECT orderid,custid,saleprice
FROM orders md
WHERE saleprice>(SELECT AVG(saleprice) FROM orders so 
				where md.custid=so.custid);'''

In [29]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [30]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0  1      2
0   2  1  21000
1   3  2   8000
2   5  4  20000
3   8  3  12000
4  10  3  13000

## Q17

In [31]:
import pandas as pd
import pymysql

In [32]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [33]:
cur_1=conn1.cursor()

In [34]:
sql='''SELECT SUM(saleprice)'total'
FROM orders
WHERE custid IN(SELECT custid FROM customer WHERE address LIKE '%대한민국%');'''

In [35]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [36]:
pd_1=pd.DataFrame(rows_1)
pd_1

       0
0  46000

## Q18

In [37]:
import pandas as pd
import pymysql

In [38]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [39]:
cur_1=conn1.cursor()

In [40]:
sql='''SELECT orderid, saleprice
FROM orders
WHERE saleprice>ALL(SELECT saleprice FROM orders WHERE custid='3');'''

In [41]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [42]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0      1
0  2  21000
1  5  20000

## Q19

In [43]:
import pandas as pd
import pymysql

In [44]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [45]:
cur_1=conn1.cursor()

In [46]:
sql='''SELECT SUM(saleprice)'total'
FROM orders od
WHERE EXISTS (SELECT * FROM customer cs 
			WHERE address LIKE '%대한민국%' AND cs.custid=od.custid );'''

In [47]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [48]:
pd_1=pd.DataFrame(rows_1)
pd_1

       0
0  46000